# AreReferencesAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..AreReferencesAvailable Property
Dimension Class See Also
---
Indicates if this dimension's references can be resolved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool AreReferencesAvailable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AreReferencesAvailable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool AreReferencesAvailable {
	bool get ();
}
```

# Remarks
This property always returns true for model dimensions. It can return false for view-specific dimensions that can lose their references in certain situations. For example, the host element references may not be available when the view containing the dimension is closed. In general, if the host element view-specific geometry is not available, dimensions that reference that geometry will not be able to resolve their references.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace